# SetOffset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanViewRange..::..SetOffset Method
PlanViewRange Class See Also
---
Set the offset value associated with a View Depth plane
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetOffset(
	PlanViewPlane planViewPlane,
	double offset
)
```

Visual Basic
---
```text
Public Sub SetOffset ( _
	planViewPlane As PlanViewPlane, _
	offset As Double _
)
```

Visual C++
---
```text
public:
void SetOffset(
	PlanViewPlane planViewPlane,
	double offset
)
```

# ### Parameters
planViewPlane
    Type: Autodesk.Revit.DB..::..PlanViewPlane View Depth plane
offset
    Type: System..::..Double Offset value
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace